Revit 2024 API
AnalyticalMember.FlipCurve Method
 Flip the Analytical Member
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public void FlipCurve()
Visual Basic
Public Sub FlipCurve
Visual C++
public:
void FlipCurve()
See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace